app/views/microposts/show.html.erb

          <% if current_user.like? @post %>
            <%= form_for current_user.likes.find_by(micropost_id: @post.id), method: :delete do |f| %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."micropost_id" = $2 LIMIT $3  [["user_id", 1], ["micropost_id", 115], ["LIMIT", 1]]

      </div>
    <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = $1  [["micropost_id", 109]]

          Posted <%= time_ago_in_words comment.created_at %>
        <% if current_user.comments.include?(comment) %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."user_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]