app/controllers/comments_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2  [["id", 109], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "micropost_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["micropost_id", 109], ["content", "aaaaaaaaa"], ["created_at", "2019-05-20 10:56:37.340883"], ["updated_at", "2019-05-20 10:56:37.340883"]]
---
  def create
    post = Micropost.find_by_id(params[:post_id])
    comment = post.comments.build(comment_params)
    redirect_back fallback_location: post if current_user.comments << comment

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    post = Micropost.find_by_id(params[:id])
    if Comment.find_by_id(params[:id]).destroy