app/controllers/crud_user_controller.rb

  def show
    @user = if params[:id].nil?
              current_user
            else
              User.find_by_id(params[:format])
            end
    @microposts = @user.microposts.paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 20]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 1]]