app/controllers/likes_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2  [["id", 121], ["LIMIT", 1]]
---
  def create
    post = Micropost.find_by_id(params[:post_id])

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2  [["id", 423], ["LIMIT", 1]]
---
  def destroy
    post = Micropost.find_by_id(params[:post_id])