app/controllers/microposts_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2  [["id", 123], ["LIMIT", 1]]
---
  def show
    @post = Micropost.find_by_id(params[:id])

INSERT INTO "microposts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @post = current_user.microposts.create(micropost_params)

DELETE FROM "microposts" WHERE "microposts"."id" = $1  [["id", 121]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 ORDER BY "microposts"."created_at" DESC LIMIT $2  [["id", 121], ["LIMIT", 1]]
---
  def destroy
    redirect_to crud_user_show_path(current_user) if Micropost.find_by_id(params[:id]).destroy