app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    @user = User.find_by_id(params[:followed_id])

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
  def destroy
    @user = Relationship.find_by_id(params[:id]).followed