app/views/crud_user/show.html.erb

    <div class="col-md-8 ">
      <% if @user.microposts.any? %>
      <h2>  microposts (<%= @user.microposts.count %>) </h2>
---
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 3]]